---
kind: enumMember
id: F:Autodesk.Revit.DB.DirectShapeRoomBoundingOption.SetByParameter
enum: Autodesk.Revit.DB.DirectShapeRoomBoundingOption
source: html/b102fe53-d044-819e-3639-bb0521cb232a.htm
---
# Autodesk.Revit.DB.DirectShapeRoomBoundingOption.SetByParameter

The associated DirectShape has a room bounding parameter which is which is writeable and defaults to on.
 If can be toggled by a user or the API (by accessing the parameter WALL_ATTR_ROOM_BOUNDING).